Revit 2027 API
BuiltInFailures.LooseDimensionFailures.LooseWallsweepsForCurtainWall Property
 Switching element type to Curtain Family. All Wall Sweeps or Reveals hosted by this instance will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LooseWallsweepsForCurtainWall { get; }
Public Shared ReadOnly Property LooseWallsweepsForCurtainWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LooseWallsweepsForCurtainWall {
	FailureDefinitionId^ get ();
}
static member LooseWallsweepsForCurtainWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LooseDimensionFailures Class
Autodesk.Revit.DB Namespace